app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
---
SELECT "todo_lists".* FROM "todo_lists"

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "12 in 12: Week 1: Todo List"], ["description", "Create 12 web apps in 12 weeks. "], ["created_at", "2017-06-27 17:50:00.749821"], ["updated_at", "2017-06-27 17:50:00.749821"]]

  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)
---
UPDATE "todo_lists" SET "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["description", "n"], ["updated_at", "2017-07-02 00:28:01.326126"], ["id", 4]]

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 2]]

    def set_todo_list
      @todo_list = TodoList.find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 2]]