app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First todo item"], ["todo_list_id", 1], ["created_at", "2017-06-27 19:18:56.860222"], ["updated_at", "2017-06-27 19:18:56.860222"]]
---
  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
  def destroy
    if @todo_item.destroy

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2017-06-28 01:49:56.512440"], ["updated_at", "2017-06-28 01:49:56.513192"], ["id", 8]]
---
  def complete
    @todo_item.update_attribute(:completed_at, Time.now)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 3], ["id", 8]]
---
  def set_todo_item
    @todo_item = @todo_list.todo_items.find(params[:id])